summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5s_regdef.h
/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_OCS_Bits B;
} Ifx_PSI5S_OCS;

/** \\brief  Pulse Generation Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_PGC_Bits B;
} Ifx_PSI5S_PGC;

/** \\brief  Receive Buffer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_RBUF_Bits B;
} Ifx_PSI5S_RBUF;

/** \\brief  Receiver Control Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_RCRA_Bits B;
} Ifx_PSI5S_RCRA;

/** \\brief  Receiver Control Register B */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_RCRB_Bits B;
} Ifx_PSI5S_RCRB;

/** \\brief  Receive Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_RDR_Bits B;
} Ifx_PSI5S_RDR;

/** \\brief  Receive Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_RDS_Bits B;
} Ifx_PSI5S_RDS;

/** \\brief  Send Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_SCR_Bits B;
} Ifx_PSI5S_SCR;

/** \\brief  Send Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_SDR_Bits B;
} Ifx_PSI5S_SDR;

/** \\brief  Target Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_TAR_Bits B;
} Ifx_PSI5S_TAR;

/** \\brief  Transmit Buffer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_TBUF_Bits B;
} Ifx_PSI5S_TBUF;

/** \\brief  Time Stamp Count Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_TSCNTA_Bits B;
} Ifx_PSI5S_TSCNTA;

/** \\brief  Time Stamp Count Register B */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_TSCNTB_Bits B;
} Ifx_PSI5S_TSCNTB;

/** \\brief  Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_TSCR_Bits B;
} Ifx_PSI5S_TSCR;

/** \\brief  Time Stamp Mirror Register TSM */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_TSM_Bits B;
} Ifx_PSI5S_TSM;

/** \\brief  Watch Dog Timer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_WDT_Bits B;
} Ifx_PSI5S_WDT;

/** \\brief  Write Hardware Bits Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_WHBCON_Bits B;
} Ifx_PSI5S_WHBCON;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5s_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  PSI5S object */
typedef volatile struct _Ifx_PSI5S
{
    Ifx_PSI5S_CLC CLC;                      /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_PSI5S_ID ID;                        /**< \brief 8, Module Identification Register */
    Ifx_PSI5S_FDR FDR;                      /**< \brief C, I2C Fractional Divider Register */
    Ifx_PSI5S_FDRT FDRT;                    /**< \brief 10, Fractional Divider Register for Time Stamp */
    Ifx_PSI5S_TSCNTA TSCNTA;                /**< \brief 14, Time Stamp Count Register A */
    Ifx_PSI5S_TSCNTB TSCNTB;                /**< \brief 18, Time Stamp Count Register B */
    Ifx_PSI5S_GCR GCR;                      /**< \brief 1C, Global Control Register */
    Ifx_PSI5S_NFC NFC;                      /**< \brief 20, Number of Frames Control Register */
    Ifx_PSI5S_FCNT FCNT;                    /**< \brief 24, Frame Counter Register */
    Ifx_PSI5S_IOCR IOCR;                    /**< \brief 28, Input and Output Control Register */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_PSI5S_RCRA RCRA[3];                 /**< \brief 30, Receiver Control Register A */
    unsigned char reserved_3C[20];          /**< \brief 3C, \internal Reserved */
    Ifx_PSI5S_RCRB RCRB[3];                 /**< \brief 50, Receiver Control Register B */
    unsigned char reserved_5C[20];          /**< \brief 5C, \internal Reserved */
    Ifx_PSI5S_WDT WDT[3];                   /**< \brief 70, Watch Dog Timer Register */
    unsigned char reserved_7C[20];          /**< \brief 7C, \internal Reserved */
    Ifx_PSI5S_TSCR TSCR[3];                 /**< \brief 90, Capture Register */
    unsigned char reserved_9C[20];          /**< \brief 9C, \internal Reserved */
    Ifx_PSI5S_RDS RDS;                      /**< \brief B0, Receive Status Register */
    Ifx_PSI5S_RDR RDR;                      /**< \brief B4, Receive Data Register */
    Ifx_PSI5S_TSM TSM;                      /**< \brief B8, Time Stamp Mirror Register TSM */
    unsigned char reserved_BC[20];          /**< \brief BC, \internal Reserved */
    Ifx_PSI5S_TAR TAR;                      /**< \brief D0, Target Address Register */
    Ifx_PSI5S_BAR BAR;                      /**< \brief D4, Base Address Register */
    unsigned char reserved_D8[24];          /**< \brief D8, \internal Reserved */
    Ifx_PSI5S_PGC PGC[3];                   /**< \brief F0, Pulse Generation Control Register */
    unsigned char reserved_FC[20];          /**< \brief FC, \internal Reserved */
    Ifx_PSI5S_CTV CTV[3];                   /**< \brief 110, Channel Trigger Value Register */
    unsigned char reserved_11C[20];         /**< \brief 11C, \internal Reserved */
    Ifx_PSI5S_SCR SCR[3];                   /**< \brief 130, Send Control Register */
    unsigned char reserved_13C[20];         /**< \brief 13C, \internal Reserved */
    Ifx_PSI5S_SDR SDR[3];                   /**< \brief 150, Send Data Register */
    unsigned char reserved_15C[20];         /**< \brief 15C, \internal Reserved */
    Ifx_PSI5S_CDW CDW;                      /**< \brief 170, CPU Direct Write Register */
    unsigned char reserved_174[156];        /**< \brief 174, \internal Reserved */
    Ifx_PSI5S_CON CON;                      /**< \brief 210, Control Register */
    Ifx_PSI5S_BG BG;                        /**< \brief 214, Baud Rate Timer/Reload Register */
    Ifx_PSI5S_FDV FDV;                      /**< \brief 218, Fractional Divider Register */
    Ifx_PSI5S_FDO FDO;                      /**< \brief 21C, Fractional Divider for Output CLK Register */
    Ifx_PSI5S_TBUF TBUF;                    /**< \brief 220, Transmit Buffer Register */
    Ifx_PSI5S_RBUF RBUF;                    /**< \brief 224, Receive Buffer Register */
    unsigned char reserved_228[40];         /**< \brief 228, \internal Reserved */
    Ifx_PSI5S_WHBCON WHBCON;                /**< \brief 250, Write Hardware Bits Control Register */
    unsigned char reserved_254[12];         /**< \brief 254, \internal Reserved */
    Ifx_PSI5S_INTSTAT INTSTAT[3];           /**< \brief 260, Interrupt Status Register */
    unsigned char reserved_26C[20];         /**< \brief 26C, \internal Reserved */
    Ifx_PSI5S_INTSET INTSET[3];             /**< \brief 280, Interrupt Set Register */
    unsigned char reserved_28C[20];         /**< \brief 28C, \internal Reserved */
    Ifx_PSI5S_INTCLR INTCLR[3];             /**< \brief 2A0, Interrupt Clear Register */
    unsigned char reserved_2AC[20];         /**< \brief 2AC, \internal Reserved */
    Ifx_PSI5S_INTEN INTEN[3];               /**< \brief 2C0, Interrupt Enable Register */
    unsigned char reserved_2CC[20];         /**< \brief 2CC, \internal Reserved */
    Ifx_PSI5S_INP INP[3];                   /**< \brief 2E0, Interrupt Node Pointer Register */
    unsigned char reserved_2EC[20];         /**< \brief 2EC, \internal Reserved */
    Ifx_PSI5S_INTOV INTOV;                  /**< \brief 300, Interrupt Overview Register */
    Ifx_PSI5S_INTSTATG INTSTATG;            /**< \brief 304, Interrupt Status Register G */
    Ifx_PSI5S_INTSETG INTSETG;              /**< \brief 308, Interrupt Set Register G */
    Ifx_PSI5S_INTCLRG INTCLRG;              /**< \brief 30C, Interrupt Clear Register G */
    Ifx_PSI5S_INTENG INTENG;                /**< \brief 310, Interrupt Enable Register G */
    Ifx_PSI5S_INPG INPG;                    /**< \brief 314, Interrupt Node Pointer G Register */
    unsigned char reserved_318[180];        /**< \brief 318, \internal Reserved */
    Ifx_PSI5S_OCS OCS;                      /**< \brief 3CC, OCDS Control and Status */
    Ifx_PSI5S_ACCEN0 ACCEN0;                /**< \brief 3D0, Access Enable Register 0 */
    Ifx_PSI5S_ACCEN1 ACCEN1;                /**< \brief 3D4, Access Enable Register 1 */
    Ifx_PSI5S_KRST0 KRST0;                  /**< \brief 3D8, Kernel Reset Register 0 */
    Ifx_PSI5S_KRST1 KRST1;                  /**< \brief 3DC, Kernel Reset Register 1 */
    Ifx_PSI5S_KRSTCLR KRSTCLR;              /**< \brief 3E0, Kernel Reset Status Clear Register */
    unsigned char reserved_3E4[3100];       /**< \brief 3E4, \internal Reserved */
} Ifx_PSI5S;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5S_REGDEF_H */
